--1)公司高管及亲属在投金额记录

select 
user_id 用户ID,
aum 在投金额,
u.real_name 真实姓名,
u.mobile_num 手机号

from
(
SELECT user_id,sum(aum) aum
FROM(
SELECT m.user_id,
       m.aum
FROM
  (SELECT user_id,
          '财神' AS platform,
          SUM(aum) aum
   FROM idw. fact_biz_csyy_aum ds
   WHERE 1=1
     AND ds.stat_date='2018-10-09'
   GROUP BY 1,
            2
   UNION ALL SELECT user_id,
                    '诺诺',
                   SUM(aum) aum
   FROM idw. fact_biz_nono_aum ds
   WHERE 1=1
     AND ds.stat_date='2018-10-09'
   GROUP BY 1,
            2) m

WHERE user_id in
(
select id from odsopr.user_info where real_name in (
"黄大容","龚文魁","石蔚明","李晓忠","陈弘","彭琛","周玉琳","谢知君","彭新贵","全心焕","季玉珍","彭思勤","李小燕","李忠林","李四英","李三英","庞青","陈奕","陈媛","赵铃","黄正良","何廷淑","夏音希","黄大林","周志泽","叶馨","韦秋金","石振瑛","何飞九","刘诗洋","石向明","王金英","柳嗣琪","谢尚希","谢丹妮","谢萍妮","LI XIAOZHONG"
)
)
) n
group by user_id

)t 

left join odsopr.user_info u on t.user_id = u.id
order by aum desc




--2)公司员工在投金额记录
select 
user_id 用户ID,
aum 在投金额,
u.real_name 真实姓名,
u.mobile_num 手机号,
u.id_num 身份证号,
if(gs.id_num is null,"否","是") 是否公司员工
from
(
SELECT user_id,sum(aum) aum
FROM(
SELECT m.user_id,
       m.aum
FROM
  (SELECT user_id,
          '财神' AS platform,
          SUM(aum) aum
   FROM idw. fact_biz_csyy_aum ds
   WHERE 1=1
     AND ds.stat_date='2018-10-09'
   GROUP BY 1,
            2
   UNION ALL SELECT user_id,
                    '诺诺',
                   SUM(aum) aum
   FROM idw. fact_biz_nono_aum ds
   WHERE 1=1
     AND ds.stat_date='2018-10-09'
   GROUP BY 1,
            2) m

WHERE user_id in
(
select id from odsopr.user_info where real_name in (
"黄大容","周玉琳","龚文魁","何渊","翁明军","于文浩","王幽雅","申佳","陈思伊","吴裔斐","王倩倩","霍黎丽","王紫微","顾敏杰","王会杏","江静","张萍","赵韦","杨福碧","张芳玲","金婷","景婷婷","李浩","郑艳","刘晓蕾","夏群","陈丽丽","唐心怡","叶宁","赵耀远","黄威","李战胜","沈治华","杨玉","王永亮","吕文豪","李耀东","何慧","胡荣萍","李娜","熊娟","刘艳","周华靓","高月军","邓丽娜","董佳佳","陈晓婕","施艳芸","郝诗梦","王励杰","宛豪杰","王镇杰","苏攀","宋祺","鲁成刚","郭幸","万苗苗","梁琦","韩志生","项文宽","王安天","曾文文","万德军","常兵兵","孙雷","刘俏","仇雷","蒋贇来","岳如意","曾存凯","程胜军","张乃平","姜晚玉","冯嘉杰","姚磊","项德拯","江家明","何延锦","王维林","赵坤","郑书培","王巨波","谭惠","汪乐娜","赵博博","任敏","张智强","樊明涛","吴小凯","李琼","李小语","王阐艺","陈梦","谈浩","何立建","应一凡","刘甦","谷旋","方煜东","冯东升","王国栋","曾亮","杨一凡","张保川","乐江恺","张萌娟","汪洋","华圆","刘重远","严志宏","胡雷","卢丛丛","马茜","柳婷","晏睿","高丽莎","郁波","郑浩","张杰","朱晓超","罗小辉","林奇","曾圣","韩浩","施湧俊","卢永党","黄冰晶","尤远明","于骁丹","金涛","程威威","王芙云","何文斌","刘佩华","王健军","杨杰","杨恒","奚勇春","许天增","吴文蓝","吴礼通","丁升","商杨子","俞俊烨","吴军朝","叶思敏","刘家平","陈霞","苟警卫","陆岳","张影影","周威","苏志宇","李菁菁","贺丹","韩亮亮","许莲容","李双双","周思聪","黄伟","曾鹏","王青","浦中元","李瑞友","吴迪","蒙亚婷","杨淑敏","石蔚明","韩佳贇","刘国全","吴姣姣","史亚苹","吉俊","王煜","杨莉青","仇美娟","邓红丽","周鹏飞","赵斌","魏朋成","云晴","LIXIAOZHONG","陈坚栋","储婷婷","翟海涛","王雪松","孙玉荣","陈怡","王彭娟","凌显玲","周瑞虹","刘静","黄鲁骏","李静婷","周敏","周金金","董越洋","严卉诗","袁丽丽","安雅秀","胡平","王燕","范梦虹","陈园","李艳文","凡凯","宋海如","卢元强","段悠然","何军","吴荣红","周烨钒","王利民","杨馨远","贾芳霞","李永强","陈利华","徐帅","胡伟","王磊","于雪莹","李思艺","韩叶青","余寿贵","刘瑜","陆宇春","封花","王磊","杨高","王语丰","张健铭","陈明","沈樑坤","单晓刚","龙亚","马晓玥","陈俊芳","李朝阳","陈晨","蒋嘉丽","钟顺敏","陈黎","陈弘","张勇耀","万超","张薇","陶孟瑶","许桂峰","黄子添","张琳","周鑫","柳林俊","何欢","张倩","徐韬","李尚坤","章月链","张颖","牛和军","周志军","徐大伟","李子贡","方炜","陈铭佳","袁郑玲","宋效林","庄浩英","肖斌","张猛","彭琛","崔启梦","徐嘉文","施艳芸","霍宇韬","王芬","王丽曼","陆士超","袁静","赵玥","陆晓燕","龙陶","梁新波","吴秀凤","方涛","朱峰","林超","王理翔","陈立涛","古倩雯","马少青","何子浩","莫俊杰","陈杜贝尔","施铭洁","朱晓琳","何东晨","马世骏","刘剑","刘璐","王根根","吴瑕","吴磊","李博","程庆龙","李林林","许金","陈桂","曹亮","张远航","计佳峰","李浩","余力","肖湘泓","胡中宝","何美红","赵洋","张友俊","杨月","王晓桐","陆侃","刘妮","李印云","余优迪","岑峰","马兵","梁志鉴","樊长青","黎先红","顾利利","司徒豪杰","郭琳","肖志超","陆凯","赵新","范金福","朱源","王琴","戴真","刘小爽","罗敏","张宸","钟繁顺","吉豪","陈思聪","李舒雯","李薇娜","张佳幸","常晓雯","高坚英","王彦文","翁唯皓","王锦月","赵燕","肖小菊","于莉莎","凌扉","宋起名","王娟","胡晨","李嘉仕","俞佩","周奕君","邱金萍","方思思","秦政涛","肖斌","牛雄飞","刘慧","高瑞","严仍伟","邢忠强","卓艳","黎欣璋","姚倩","夏蓉蓉","胡甜甜","崔莹莹","吕海霞","林志强","刘欢欢","张玉婷","王洪雨","季一青","赵朋","张保磊","钱广凯","程康晖","郭姣姣","朱晓菊","郤玉明","徐罗俊","余海霞","徐方艺","文方舟","任艳","康玲","王瑞","曹佳慧","李文静","李迪","翁婷逸","刘海燕","何金","贾锐","李开其","关媛媛","魏珍","曹琴","李晨红","刘秀萍","宋明","魏婷","罗南彬","罗梦林","张雷","陈莎莎","何娟","雷婷","方喆","周辰","安景琨","冯迪","毛晨","王子豪","陈亚同","朱福霞","郑坤","魏克川","陶君敏","蒋功媛","戴鼎峰","徐进文","许红赟","周原修","李学建","迟晓祥","郝国文","鲁威","孙博远","张书行","张彩娟","刘赛","朱红晨","孙善银","高敏","LI XIAOZHONG"
)
)
) n
group by user_id

)t 

left join odsopr.user_info u on t.user_id = u.id
left join  msc.gs_idnum_1011 gs on u.id_num = gs.id_num
order by aum desc





--3）公司高管及亲属当前借款情况
select 
    bo.user_id 用户ID,
    u.real_name 真实姓名
    ,u.mobile_num 手机号
    ,u.id_num 身份证号
    ,cou 借款笔数,
    bo_finish_price 借款金额
    ,br_price_b 贷款余额
    ,br_repay_time 还清时间 
  ,if(gs.id_num is null,"否","是") 是否公司员工  
from 
(
select
   user_id,
   count(1) cou,
   sum(bo_finish_price)  bo_finish_price
from idw.fact_borrows
where 1=1
and  bo_is_success=1
and bo_all_repayed = 0
and user_id in
(
select id from odsopr.user_info where real_name in (
"黄大容","龚文魁","石蔚明","李晓忠","陈弘","彭琛","周玉琳","谢知君","彭新贵","全心焕","季玉珍","彭思勤","李小燕","李忠林","李四英","李三英","庞青","陈奕","陈媛","赵铃","黄正良","何廷淑","夏音希","黄大林","周志泽","叶馨","韦秋金","石振瑛","何飞九","刘诗洋","石向明","王金英","柳嗣琪","谢尚希","谢丹妮","谢萍妮","LI XIAOZHONG"
)
) group by user_id

) bo
left  join   
(select user_id,sum(br_price_b) br_price_b,max(br_time) br_repay_time from idw.fact_borrows_repayment where br_is_repay=0 group by user_id) 
br on  br.user_id=bo.user_id
left join odsopr.user_info u on bo.user_id = u.id
left join  msc.gs_idnum_1011 gs on u.id_num = gs.id_num
order by bo.bo_finish_price desc
;




--4）公司员工当前借款情况
select 
    bo.user_id 用户ID,
    u.real_name 真实姓名
    ,u.mobile_num 手机号
    ,u.id_num 身份证号
    ,cou 借款笔数,
    bo_finish_price 借款金额
    ,br_price_b 贷款余额
    ,br_repay_time 还清时间 
  ,if(gs.id_num is null,"否","是") 是否公司员工  
from 
(
select
   user_id,
   count(1) cou,
   sum(bo_finish_price)  bo_finish_price
from idw.fact_borrows
where 1=1
and  bo_is_success=1
and bo_all_repayed = 0
and user_id in
(
select id from odsopr.user_info where real_name in (
"黄大容","周玉琳","龚文魁","何渊","翁明军","于文浩","王幽雅","申佳","陈思伊","吴裔斐","王倩倩","霍黎丽","王紫微","顾敏杰","王会杏","江静","张萍","赵韦","杨福碧","张芳玲","金婷","景婷婷","李浩","郑艳","刘晓蕾","夏群","陈丽丽","唐心怡","叶宁","赵耀远","黄威","李战胜","沈治华","杨玉","王永亮","吕文豪","李耀东","何慧","胡荣萍","李娜","熊娟","刘艳","周华靓","高月军","邓丽娜","董佳佳","陈晓婕","施艳芸","郝诗梦","王励杰","宛豪杰","王镇杰","苏攀","宋祺","鲁成刚","郭幸","万苗苗","梁琦","韩志生","项文宽","王安天","曾文文","万德军","常兵兵","孙雷","刘俏","仇雷","蒋贇来","岳如意","曾存凯","程胜军","张乃平","姜晚玉","冯嘉杰","姚磊","项德拯","江家明","何延锦","王维林","赵坤","郑书培","王巨波","谭惠","汪乐娜","赵博博","任敏","张智强","樊明涛","吴小凯","李琼","李小语","王阐艺","陈梦","谈浩","何立建","应一凡","刘甦","谷旋","方煜东","冯东升","王国栋","曾亮","杨一凡","张保川","乐江恺","张萌娟","汪洋","华圆","刘重远","严志宏","胡雷","卢丛丛","马茜","柳婷","晏睿","高丽莎","郁波","郑浩","张杰","朱晓超","罗小辉","林奇","曾圣","韩浩","施湧俊","卢永党","黄冰晶","尤远明","于骁丹","金涛","程威威","王芙云","何文斌","刘佩华","王健军","杨杰","杨恒","奚勇春","许天增","吴文蓝","吴礼通","丁升","商杨子","俞俊烨","吴军朝","叶思敏","刘家平","陈霞","苟警卫","陆岳","张影影","周威","苏志宇","李菁菁","贺丹","韩亮亮","许莲容","李双双","周思聪","黄伟","曾鹏","王青","浦中元","李瑞友","吴迪","蒙亚婷","杨淑敏","石蔚明","韩佳贇","刘国全","吴姣姣","史亚苹","吉俊","王煜","杨莉青","仇美娟","邓红丽","周鹏飞","赵斌","魏朋成","云晴","LIXIAOZHONG","陈坚栋","储婷婷","翟海涛","王雪松","孙玉荣","陈怡","王彭娟","凌显玲","周瑞虹","刘静","黄鲁骏","李静婷","周敏","周金金","董越洋","严卉诗","袁丽丽","安雅秀","胡平","王燕","范梦虹","陈园","李艳文","凡凯","宋海如","卢元强","段悠然","何军","吴荣红","周烨钒","王利民","杨馨远","贾芳霞","李永强","陈利华","徐帅","胡伟","王磊","于雪莹","李思艺","韩叶青","余寿贵","刘瑜","陆宇春","封花","王磊","杨高","王语丰","张健铭","陈明","沈樑坤","单晓刚","龙亚","马晓玥","陈俊芳","李朝阳","陈晨","蒋嘉丽","钟顺敏","陈黎","陈弘","张勇耀","万超","张薇","陶孟瑶","许桂峰","黄子添","张琳","周鑫","柳林俊","何欢","张倩","徐韬","李尚坤","章月链","张颖","牛和军","周志军","徐大伟","李子贡","方炜","陈铭佳","袁郑玲","宋效林","庄浩英","肖斌","张猛","彭琛","崔启梦","徐嘉文","施艳芸","霍宇韬","王芬","王丽曼","陆士超","袁静","赵玥","陆晓燕","龙陶","梁新波","吴秀凤","方涛","朱峰","林超","王理翔","陈立涛","古倩雯","马少青","何子浩","莫俊杰","陈杜贝尔","施铭洁","朱晓琳","何东晨","马世骏","刘剑","刘璐","王根根","吴瑕","吴磊","李博","程庆龙","李林林","许金","陈桂","曹亮","张远航","计佳峰","李浩","余力","肖湘泓","胡中宝","何美红","赵洋","张友俊","杨月","王晓桐","陆侃","刘妮","李印云","余优迪","岑峰","马兵","梁志鉴","樊长青","黎先红","顾利利","司徒豪杰","郭琳","肖志超","陆凯","赵新","范金福","朱源","王琴","戴真","刘小爽","罗敏","张宸","钟繁顺","吉豪","陈思聪","李舒雯","李薇娜","张佳幸","常晓雯","高坚英","王彦文","翁唯皓","王锦月","赵燕","肖小菊","于莉莎","凌扉","宋起名","王娟","胡晨","李嘉仕","俞佩","周奕君","邱金萍","方思思","秦政涛","肖斌","牛雄飞","刘慧","高瑞","严仍伟","邢忠强","卓艳","黎欣璋","姚倩","夏蓉蓉","胡甜甜","崔莹莹","吕海霞","林志强","刘欢欢","张玉婷","王洪雨","季一青","赵朋","张保磊","钱广凯","程康晖","郭姣姣","朱晓菊","郤玉明","徐罗俊","余海霞","徐方艺","文方舟","任艳","康玲","王瑞","曹佳慧","李文静","李迪","翁婷逸","刘海燕","何金","贾锐","李开其","关媛媛","魏珍","曹琴","李晨红","刘秀萍","宋明","魏婷","罗南彬","罗梦林","张雷","陈莎莎","何娟","雷婷","方喆","周辰","安景琨","冯迪","毛晨","王子豪","陈亚同","朱福霞","郑坤","魏克川","陶君敏","蒋功媛","戴鼎峰","徐进文","许红赟","周原修","李学建","迟晓祥","郝国文","鲁威","孙博远","张书行","张彩娟","刘赛","朱红晨","孙善银","高敏","LI XIAOZHONG"
)
) group by user_id

) bo
left  join   
(select user_id,sum(br_price_b) br_price_b,max(br_time) br_repay_time from idw.fact_borrows_repayment where br_is_repay=0 group by user_id) 
br on  br.user_id=bo.user_id
left join odsopr.user_info u on bo.user_id = u.id
left join  msc.gs_idnum_1011 gs on u.id_num = gs.id_num
order by bo.bo_finish_price desc
;

